---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineColor
source: html/d4a4b1af-8bea-8573-8113-1a5a85cf0a26.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineColor Property

Color of outline and fence lines in the diagram.

## Syntax (C#)
```csharp
public Color OutlineColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null